# 入力データ
# 0,0,1,1,1,1,1,1,1,1,1,1,1,1,0,0
# 1,1,0,0,0,0,0,0,0,0,0,0,0,0,1,1
# 1,0,0,1,1,1,0,0,0,1,1,1,0,0,0,1
# 1,1,0,0,0,0,1,1,0,0,0,0,0,0,1,1
# 0,0,1,1,1,1,1,1,1,1,1,1,1,1,0,0
# 0,0,0,1,1,1,0,0,0,0,0,1,1,1,0,0
# 0,0,0,0,1,1,1,0,0,0,0,0,0,1,1,1
# _

lists = []
while True:
    line = input()
    if line == "_":
        break
    lists.append(line.split(","))


for line in lists:
    for point in line:
        if int(point) == 1:
            print("#", end="")
        else:
            print(" ", end="")
    print("")